app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "category_name", "updated_at") VALUES('2010-10-11 18:22:22', 'Text', '2010-10-11 18:22:22')