app/controllers/posts_controller.rb

  def index
    @posts = Post.all(:order => "timestamp DESC")
---
SELECT * FROM "posts" ORDER BY timestamp DESC

  def edit
    @post = Post.find(params[:id])
    @cat = Category.find(:all)
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "categories" WHERE ("categories"."id" = 2)

  def create
    @post = Post.new(params[:post])
    @post.category_id = (params[:category])
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "title", "body", "timestamp", "updated_at", "category_id") VALUES('2010-10-11 19:50:53', 'This is a test of backwards dating', 'This post should appear at a much older date.', '2008-09-08 19:50:00', '2010-10-11 19:50:53', 1)

  def update
    @post = Post.find(params[:id])
    @post.category_id = (params[:category])
    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "body" = 'Lorem ipsum dolor sit amet, CONSECTETUR ADIPISICING ELIT, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.