app/controllers/writing_controller.rb

  def text
    @poems_by_month = Post.find_all_by_category_id("1", :order => "timestamp DESC").group_by { |post| post.timestamp.strftime("%B %Y") }
---
SELECT * FROM "posts" WHERE ("posts"."category_id" = '1') ORDER BY timestamp DESC

  def poem
    #@poems = Post.find_all_by_category_id("2")
    @poems_by_month = Post.find_all_by_category_id("2", :order => "timestamp DESC").group_by { |post| post.timestamp.strftime("%B %Y") }
---
SELECT * FROM "posts" WHERE ("posts"."category_id" = '2') ORDER BY timestamp DESC

  def else
    @poems_by_month = Post.find_all_by_category_id("3", :order => "timestamp DESC").group_by { |post| post.timestamp.strftime("%B %Y") }
---
SELECT * FROM "posts" WHERE ("posts"."category_id" = '3') ORDER BY timestamp DESC

  def misc
    @poems_by_month = Post.find_all_by_category_id("4", :order => "timestamp DESC").group_by { |post| post.timestamp.strftime("%B %Y") }
---
SELECT * FROM "posts" WHERE ("posts"."category_id" = '4') ORDER BY timestamp DESC

  def index
    @last_post = Post.last
---
SELECT * FROM "posts" ORDER BY posts.id DESC LIMIT 1

  def view
    @post = Post.find_by_id(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" IS NULL) LIMIT 1